## Production: lambda-api
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 2 to add, 1 to change, 2 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_api_gateway_deployment.api must be replaced
+/- resource "aws_api_gateway_deployment" "api" {
      ~ created_date  = "2021-10-21T13:58:05Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:ca-central-1:296255494825:71oj6jax35/" -> (known after apply)
      ~ id            = "hdo3k7" -> (known after apply)
      ~ invoke_url    = "https://71oj6jax35.execute-api.ca-central-1.amazonaws.com/" -> (known after apply)
      + triggers      = {
          + "redeployment" = "c565a2f69fc5f1972c119e1220c52c079b94f2ca"
        } # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_api_gateway_stage.api will be updated in-place
  ~ resource "aws_api_gateway_stage" "api" {
      ~ deployment_id         = "hdo3k7" -> (known after apply)
        id                    = "ags-71oj6jax35-v1"
        tags                  = {}
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_lambda_permission.api_1 must be replaced
-/+ resource "aws_lambda_permission" "api_1" {
      ~ id            = "AllowAPIGatewayInvoke1" -> (known after apply)
      + qualifier     = "latest" # forces replacement
        # (5 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.api_lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_rest_api.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_stage.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.api_gateway_log_group"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-1-error-1-minute-warning-lambda-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-10-error-5-minutes-critical-lambda-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.api-lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.ecr"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.api_cloudwatch"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_user.ecr-user"]
WARN - plan.json - main - Missing Common Tags: ["aws_kinesis_firehose_delivery_stream.firehose-api-lambda-waf-logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_lambda_function.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.ecr-user-access-key"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.new-relic-license-key"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_web_acl.api_lambda"]

35 tests, 17 passed, 18 warnings, 0 failures, 0 exceptions

```

</details>
